-----------------------------------------------------------------------------
-- Belial web waf
-- Author: 逆雪寒
-- Copyright (c) 2013 半夜三更
-- 
-- 安装说明
-- 
-- 
-- 
-----------------------------------------------------------------------------

Conf = {
-----------------------------------------------------------------------------
-- belial lua代码所在的目录
	rootDirectory = "/data/",

-----------------------------------------------------------------------------	
--	post白名单机制
--	是否开启post白名单

	whiteModule = "On",
	
--	是否开启收集,可以先开启 收集个几天，然后获得大部分得post白名单之后再关闭。
--	注意：只有 whiteModule = "On" 和 getTogether = "Off" 后 白名单拦截机制才正式启动

	getTogether = "Off",
	
--	你的网站根目录

	webProjectRootDirectory = "/usr/local/www/nginx",
	
-----------------------------------------------------------------------------
-- nginx 畸形路径解释防御

	cgiPathinfoModule = "On",

-----------------------------------------------------------------------------
-- 自定义拦截界面
-- 只需要写文件名比如： xxoo.html ，然后到 参数：rootDirectory  定义的路径下建 xxoo.html文件名(注意路径和文件权限)

	attackHtmlPageName = "",
	
-----------------------------------------------------------------------------
	allowIpAllAccess = {"202.103.224.68","10.211.55.22"}, --不受拦截ip
	cookieMatch = "On",	  -- 是否对cookie进行关键字匹配判断
	postMatch   = "On",   -- 是否对post请求进行关键字匹配判断
	toLog		  = "On", -- 攻击信息是否纪录到日志文件
	logDirectory  = "cake/"
}